; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v2 ?v8)
		(pred_4 ?v7)
		(pred_5 ?v3)
		(pred_2 ?v3)
		(pred_1 ?v7 ?v3)
		(pred_3)
		(pred_6 ?v7))

   (:action op_1
       :parameters  (?v4 ?v6)
       :precondition (and (not-eq ?v4 ?v6) 
                          (pred_5 ?v4) (pred_5 ?v6) (pred_2 ?v4))
       :effect (and  (pred_2 ?v6)
		     (not (pred_2 ?v4))))


   (:action op_3
       :parameters (?v5 ?v1)
       :precondition  (and  (pred_4 ?v5) (pred_5 ?v1)
			    (pred_1 ?v5 ?v1) (pred_2 ?v1) (pred_3))
       :effect (and (pred_6 ?v5)
		    (not (pred_1 ?v5 ?v1)) 
		    (not (pred_3))))

   (:action op_2
       :parameters  (?v5  ?v1)
       :precondition  (and  (pred_4 ?v5) (pred_5 ?v1)
			    (pred_6 ?v5) (pred_2 ?v1))
       :effect (and (pred_1 ?v5 ?v1)
		    (pred_3)
		    (not (pred_6 ?v5)))))

; problem
(define (problem ferry-l5-c2)
(:domain ferry)
(:objects obj_07 obj_04 obj_06 obj_02 obj_01 
          obj_03 obj_05 
)
(:init
(pred_5 obj_07)
(pred_5 obj_04)
(pred_5 obj_06)
(pred_5 obj_02)
(pred_5 obj_01)
(pred_4 obj_03)
(pred_4 obj_05)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_06)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_02)
(not-eq obj_02 obj_07)
(not-eq obj_07 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(pred_3)
(pred_1 obj_03 obj_07)
(pred_1 obj_05 obj_02)
(pred_2 obj_07)
)
(:goal
(and
(pred_1 obj_03 obj_01)
(pred_1 obj_05 obj_06)
)
)

(:constraints
  (and
    (sometime-before  (pred_1 obj_03 obj_01) (pred_2 obj_04))
    (sometime-before  (pred_1 obj_05 obj_06) (pred_2 obj_04))
  )
)
)

; plan
1. (op_3 obj_03 obj_07)
   deleted: (pred_1 obj_03 obj_07) (pred_3)
   added: (pred_6 obj_03)
   goals met: 0 of 2
2. (op_1 obj_07 obj_06)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_06)
   goals met: 0 of 2
3. (op_2 obj_03 obj_06)
   deleted: (pred_6 obj_03)
   added: (pred_1 obj_03 obj_06) (pred_3)
   goals met: 0 of 2
4. (op_1 obj_06 obj_02)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_02)
   goals met: 0 of 2
5. (op_3 obj_05 obj_02)
   deleted: (pred_1 obj_05 obj_02) (pred_3)
   added: (pred_6 obj_05)
   goals met: 0 of 2
6. (op_1 obj_02 obj_04)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_04)
   goals met: 0 of 2
7. (op_2 obj_05 obj_04)
   deleted: (pred_6 obj_05)
   added: (pred_1 obj_05 obj_04) (pred_3)
   goals met: 0 of 2
8. (op_1 obj_04 obj_06)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_06)
   goals met: 0 of 2
9. (op_3 obj_03 obj_06)
   deleted: (pred_1 obj_03 obj_06) (pred_3)
   added: (pred_6 obj_03)
   goals met: 0 of 2
10. (op_1 obj_06 obj_01)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_01)
   goals met: 0 of 2
11. (op_2 obj_03 obj_01)
   deleted: (pred_6 obj_03)
   added: (pred_1 obj_03 obj_01) (pred_3)
   goals met: 1 of 2
12. (op_1 obj_01 obj_04)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_04)
   goals met: 1 of 2
13. (op_3 obj_05 obj_04)
   deleted: (pred_1 obj_05 obj_04) (pred_3)
   added: (pred_6 obj_05)
   goals met: 1 of 2
14. (op_1 obj_04 obj_06)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_06)
   goals met: 1 of 2
15. (op_2 obj_05 obj_06)
   deleted: (pred_6 obj_05)
   added: (pred_1 obj_05 obj_06) (pred_3)
   goals met: 2 of 2
